Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E01D.tmx
Source language: en_us
Languages: zh_cn

source: The Correct Way to Clean Eyeglasses
zh_cn: 清洁眼镜的正确方法

source: We've all done it. When our glasses are smudged up we reach for the corner of our shirt and clean them off.
zh_cn: 我们都用衣角擦拭过眼镜。

source: You probably even know that's the wrong way to clean glasses, but you do it anyway.
zh_cn: 也许你也知道这是不对的，可还是会这么做。

source: But you don't need special sprays and microfiber cloth to clean glasses the right way, the Wall Street Journal says you only need kitchen soap and a normal cotton cloth.
zh_cn: 按华尔街日报的说法，要正确地清洁眼镜的话，你并不需要专用擦镜液和擦镜布。你需要的只是一些洗洁精和一块适合的棉布。

source: The reason your shirt is terrible for cleaning glasses is because it's likely filled with dust, and that scratches the lenses.
zh_cn: 为什么不能用衣服擦眼镜呢？因为上面有灰尘，它会刮花镜片。

source: Otherwise, any old piece of cotton will do, and regular old kitchen soap is far better than those cleaning solutions you get at the optometrist:
zh_cn: 一块旧棉布和一些日常用的洗洁精就能将眼镜清洁如新，效果比"眼镜专家"推荐的专用产品什么的好多了。

source: The AOA recommends washing glasses every morning, paying special attention to the frames and earpieces, where hair product and makeup tend to rub off.
zh_cn: AOA(美国光学会)建议每天早晨清洗眼镜，特别注意框架及眼镜腿儿，因为那些护发产品和化妆品会在上面留下痕迹。

source: Whatever you do, don't use the most handy form of water to clean your lenses. "Some people use spit, but don't," urges Dr. Geist.
zh_cn: 千万不要用随手可得的水来清洗，“有些人甚至用唾液,太不应该了。” Geist医生说.

source: Though dirty glasses won't cause an eye infection, saliva "is not the best hygiene method, and it just won't work very well," she says.
zh_cn: 虽然脏的眼镜片不会造成眼睛发炎，她说：“毕竟唾液不健康卫生,而且也没那么好用。”

source: Soap, warm water and a dry cloth are all you need, once a day, to keep glasses optimally clean and functional.
zh_cn: 你需要的是，一块香皂，一些温水与一块干布，以及每天花一丁点时间，就能让你的眼镜干净又好用。

source: You also shouldn't use anything with ammonia, bleach, vinegar (although it's great for drinking glasses), or window cleaner because those chemicals strip away the coatings on your glasses.
zh_cn: 也不要使用氨水漂白水醋(醋用来洗玻璃杯很好用哟)窗户清洁剂什么的，因为那些化学产品会腐蚀眼镜上的涂层。

source: Keeping your glasses in optimal shape is really easy when you do it right.
zh_cn: 只要你做对了，保持眼镜干净好用其实很简单。

source: That should be just enough to keep those fancy new computer glasses in optimal shape too.
zh_cn: 也同样适用于那些高科技眼镜，比如Google眼镜神马的。
